/*Fields- ин поляи класс мебошад ва хусусияти пинхони дорад. Яне мо агар поляро созем онро напрямой наметавонем инициализировать
кунем. Мо метавонем онро ба воситаи метод ё проперти кимат бахшем. поля модификатори Private дорад. 
Property баракси поля модификатори паблик дорад ва мо метавонем на прямой онро кимат бахшем. Дорои хусусиятхои
гет ва сет аст ки онхо автомати хам монда мешаванд. Мисол Public strin Name{get; set;}. Агар поля созем лозим 
мешавад ки онро тавассути проперти ё метод кимат бахшем*/